Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: ཆོས་འདི་བཞི་ཐབས་ཀྱི་ཡེ་ཤེས་ཀྱི་ཚོགས་སུ་འགྱུར་ཏེ། བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ། འཇིག་རྟེན་པའི་རྗེས་སུ་འཇུག་པ་དང་། མདོ་སྡེའི་རྗེས་སུ་འཇུག་པ་དང་། ཆོས་ཀྱི་རྗེས་སུ་འཇུག་པ་དང་། ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འཇུག་པ་སྟེ། ཆོས་བཞི་པོ་དེ་དག་ཐབས་ཀྱི་ཡེ་ཤེས་ཀྱི་ཚོགས་སུ་འགྱུར་རོ། །
en: “There are four things that enable the accumulation of the knowledge of skillful means. What are these four things? They are being in harmony with the world, being in harmony with the sūtras, being in harmony with the Dharma, and being in harmony with knowledge. These are the four things that enable the accumulation of the knowledge of skillful means.

source: ཆོས་འདི་བཞི་ལམ་གྱི་ཚོགས་ཀྱི་ཡེ་ཤེས་ལ་འཇུག་པར་འགྱུར་ཏེ། བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཕ་རོལ་ཏུ་ཕྱིན་པའི་ལམ་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ལམ་དང་། ཡན་ལག་བརྒྱད་པའི་ལམ་དང་། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་སུ་འགྲོ་བའི་ལམ་སྟེ། ཆོས་བཞི་པོ་དེ་དག་ལམ་གྱི་ཚོགས་ཀྱི་ཡེ་ཤེས་ལ་འཇུག་པར་འགྱུར་རོ། །
en: “There are four ways to engage with the knowledge of the accumulations of the path. What are these four ways? They are the path of the perfections, the path of the elements that are conducive to awakening, the eightfold path, and the path that leads to the knowledge of omniscience. These are the four ways to engage with the knowledge of the accumulations of the path.

source: མི་ངོམས་པ་འདི་བཞི་ཡེ་ཤེས་ཀྱི་ཚོགས་སོགས་པར་འགྱུར་ཏེ། བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཐོས་པས་མི་ངོམས་པ་དང་། བསྟན་པས་མི་ངོམས་པ་དང་། དཔྱོད་པས་མི་ངོམས་པ་དང་། ཡེ་ཤེས་ཀྱིས་མི་ངོམས་པ་སྟེ། མི་ངོམས་པ་བཞི་པོ་དེ་དག་ཡེ་ཤེས་ཀྱི་ཚོགས་སོགས་པར་འགྱུར་རོ། །
en: “There are four kinds of thirst that enable the accumulation of knowledge. What are these four kinds of thirst? They are thirst for learning, thirst for teaching, thirst for investigation, and thirst for knowledge. These are the four kinds of thirst that enable the accumulation of knowledge.

source: གཞན་ཡང་ཡེ་ཤེས་ཀྱི་ཚོགས་ནི་གང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་རྗེས་སུ་འགྲོ་བ་དང་། ཞིང་ཐམས་ཅད་ཀྱི་རྗེས་སུ་འགྲོ་བ་སྟེ། སྦྱིན་པ་ལས་ཀྱང་ཡེ་ཤེས་ཀྱི་ཚོགས་སུ་བལྟའོ། ། ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་དང་། བྱམས་པ་དང་། སྙིང་རྗེ་དང་། དགའ་བ་དང་། བཏང་སྙོམས་ལས་ཀྱང་ཡེ་ཤེས་ཀྱི་ཚོགས་སུ་བལྟའོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཇི་ཙམ་དུ་བྱང་ཆུབ་སེམས་དཔའི་རྩོམ་པ་དེ་ཐམས་ཅད་ཡེ་ཤེས་ཀྱི་ཁར་ལས་པ་ཡེ་ཤེས་སྔོན་དུ་འགྲོ་བ། ཡེ་ཤེས་ལ་རྟོན་པ་སྟེ། དེ་ཡེ་ཤེས་ལ་གནས་པས་ཡེ་ཤེས་ཅན་ཐམས་ཅད་ཀྱི་རྟོན་པར་འགྱུར་ཏེ། བདུད་ཐམས་ཅད་ཀྱིས་ཀྱང་དེ་ལ་གླགས་མི་རྙེད་དོ། ། སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱང་འཐོབ། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ལ་ཡང་གཞོག་པར་བྱེད་དོ། །
en: “Furthermore, the accumulation of knowledge is being in harmony with all sentient beings and being in harmony with all buddha fields. It should be noted that the accumulation of knowledge follows from generosity. It should be noted that the accumulation of knowledge follows from morality, patient acceptance, vigor, meditation, wisdom, love, compassion, empathetic joy, and equanimity. Why is this? Any task a bodhisatva undertakes rests on knowledge, is preceded by knowledge, and is supported by knowledge. As it is based on knowledge, it becomes a support for omniscience. No māras are able to penetrate it. One attains the blessings of the buddhas. One reaches the knowledge of omniscience.

source: དེ་གཉིས་ནི་བྱང་ཆུབ་སེམས་དཔའི་བསོད་ནམས་ཀྱི་ཚོགས་དང་། ཡེ་ཤེས་ཀྱི་ཚོགས་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚོགས་དེ་གཉིས་ལ་མཁས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །
en: “This is the bodhisatva’s accumulation of merit and his accumulation of knowledge, and with skill in these two kinds of accumulation, the bodhisatva, the great being, practices the perfection of wisdom.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དྲན་པ་ཉེ་བར་གཞག་པ་ལ་མཁས་པ་གང་ཞེ་ན། འདི་བཞི་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དྲན་པ་ཉེ་བར་གཞག་པ་སྒོམ་པ་སྟེ། བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ལུས་ལ་ལུས་ཀྱི་རྗེས་སུ་ལྟ་བ་དྲན་པ་ཉེ་བར་གཞག་པ་སྒོམ་པ་དང་། ཚོར་བ་ལ་ཚོར་བའི་རྗེས་སུ་ལྟ་བ་དྲན་པ་ཉེ་བར་གཞག་པ་སྒོམ་པ་དང་། སེམས་ལ་སེམས་ཀྱི་རྗེས་སུ་ལྟ་བ་དྲན་པ་ཉེ་བར་གཞག་པ་སྒོམ་པ་དང་། ཆོས་ལ་ཆོས་ཀྱི་རྗེས་སུ་ལྟ་བ་དྲན་པ་ཉེ་བར་གཞག་པ་སྒོམ་པའོ། །
en: “What is the bodhisatvas’ skilled approach to the foundations of mindfulness? There are four foundations of mindfulness to cultivate. What are these four foundations of mindfulness? They are using the body to cultivate mindfulness by observing the body, using feelings to cultivate mindfulness by observing feelings, using the mind to cultivate mindfulness by observing the mind, and using phenomena to cultivate mindfulness by observing phenomena.

source: དེ་ལ་ལུས་ལ་ལུས་ཀྱི་རྗེས་སུ་ལྟ་བ་དྲན་པ་ཉེ་བར་གཞག་པ་སྒོམ་པ་གང་ཞེ་ན། ། ཤཱ་རིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའི་ལུས་ལ་ལུས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་གནས་པ་དེ་ལུས་ཀྱི་སྔོན་གྱི་མཐའ་ལ་ཡང་སོ་སོར་རྟོག ། ལུས་ཀྱི་ཕྱི་མའི་མཐའ་ལ་ཡང་སོ་སོར་རྟོག ། ལུས་ཀྱི་ད་ལྟར་བྱུང་བ་ལ་ཡང་སོ་སོར་རྟོག་སྟེ། ཀྱེ་མའོ་ལུས་འདི་ནི་ཕྱིན་ཅི་ལོག་ལས་བྱུང་བ་སྟེ། རྒྱུ་དང་རྐྱེན་ལས་སྐྱེས་པ། གཡོ་བ་མེད་པ། བྱེད་པ་མེད་པ། བདག་པོ་མེད་པ། ཡོངས་སུ་འཛིན་པ་མེད་པ། འདི་ལྟ་སྟེ་དཔེར་ན། ཕྱི་རོལ་གྱི་རྩྭ་དང་། ཤིང་གེལ་པ་དང་། སྨན་དང་། ནགས་ཚལ་དག་རྒྱུ་དང་རྐྱེན་ལས་འབྱུང་ཞིང་བདག་པོ་མེད་པ་ཡོངས་སུ་འཛིན་པ་མེད་པ་དེ་བཞིན་དུ་ལུས་འདི་ཡང་རྩྭ་དང་། རྩིག་པ་དང་། ཤིང་དང་། བོང་བ་དང་། མིག་ཡོར་ལྟ་བུ། ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་ཡོངས་སུ་འཛིན་པ། བདག་དང་བདག་གི་འམ། རྟག་པ་འམ། བརྟན་པའམ། ཐེར་ཟུག་གམ། མི་འགྱུར་བའི་ཆོས་ཀྱིས་སྟོང་སྟེ། ལུས་དེ་ལ་ང་ཡིར་མི་བྱའི་ལུས་སྙིང་པོ་མེད་པ་དེས་སྙིང་པོ་བླང་བར་བྱའོ། ། དེ་ལ་སྙིང་པོ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དེ་བཞིན་གཤེགས་པའི་སྐུའོ། ། དེ་བཞིན་གཤེགས་པའི་སྐུ་ནི་ཆོས་ཀྱི་སྐུ། རྡོ་རྗེའི་སྐུ། མི་ཕྱེད་པའི་སྐུ། སྲ་བའི་སྐུ། འཇིག་རྟེན་གསུམ་པོ་ཐམས་ཅད་དང་ཁྱད་ཞུགས་པའི་སྐུ་བདག་གིས་བསྒྲུབ་པར་བྱའོ། ། བདག་གི་ལུས་འདི་ཉེས་པ་དུ་མའི་སྐྱོན་ཆགས་མོད་ཀྱི། འོན་ཀྱང་ཉེས་པ་ཐམས་ཅད་དང་བྲལ་བའི་དེ་བཞིན་གཤེགས་པའི་སྐུ་ཐོབ་པར་བྱའོ། །
en: “How does one use the body to cultivate mindfulness by observing the body? Śāriputra, a bodhisatva dwells using his body to observe his body. He contemplates what the body used to be like, how the body will end up, and what the body is like in the present, ‘Alas, this body arises from delusion. It originates from causes and conditions. It is helpless, passive, ownerless, and cannot be kept. External things like grass, bushes, herbs, and forests come about on the basis of causes and conditions. They are ownerless, and they cannot be kept, and this body is just the same. It is like grass, plaster, wood, dirt, or a statue. It consists of the skandhas, the elements, and the sense fields. It is empty of a self, of an owner, of permanence, of stability, of durability, of anything that does not change. There is no ownership to be found in this body. Nonetheless, by using this insubstantial body, we can find something of substance. What is this? It is the body of the tathāgata. With the body of the tathāgata we will attain the Dharma body, the vajra body, the unbreakable body, the body of firmness, the body that is distinguished throughout the whole of the threefold world. Even though this body of mine is defiled by many faults, it can still be used to attain the body of the tathāgata, which is free from all faults.’

source: ཞེས་དེ་སོ་སོར་རྟོག་པའི་མཐུས་ལེགས་པར་མཐོང་ནས་འབྱུང་བ་ཆེན་པོའི་གནས་ཀྱི་ལུས་ཡོངས་སུ་སྲུང་བར་བྱེད་དེ། ངའི་ལུས་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཅི་དགོས་པར་ཟད་པར་བྱའོ། ། འདི་ལྟ་སྟེ་དཔེར་ན། ཕྱི་རོལ་གྱི་འབྱུང་བ་ཆེན་པོ་བཞི་པོ་སའི་ཁམས་དང་། ཆུའི་ཁམས་དང་། མེའི་ཁམས་དང་། རླུང་གི་ཁམས་སྒོ་སྣ་ཚོགས་དང་། དམིགས་པ་སྣ་ཚོགས་དང་། རྣམ་གྲངས་སྣ་ཚོགས་དང་། ཡོ་བྱད་སྣ་ཚོགས་དང་། ཡོངས་སུ་སྤྱོད་པ་སྣ་ཚོགས་ཀྱིས་སེམས་ཅན་རྣམས་ཉེ་བར་འཚོ་བ་དེ་བཞིན་དུ་བདག་གི་འབྱུང་བ་ཆེན་པོ་བཞི་ལས་གྱུར་པའི་ལུས་འདི་སྒོ་སྣ་ཚོགས་དང་། དམིགས་པ་སྣ་ཚོགས་དང་། རྣམ་གྲངས་སྣ་ཚོགས་དང་། ཡོངས་སུ་སྤྱོད་པ་སྣ་ཚོགས་ཀྱིས་སེམས་ཅན་རྣམས་ཀྱི་ཉེ་བར་འཚོ་བར་གྱུར་ཅིག་སྙམ་མོ། ། དེ་ལུས་མི་རྟག་པ་ཉིད་དུ་ཡང་སོ་སོར་རྟོག་མོད་ཀྱི་སྐྱེ་བ་དང་། ཤི་འཕོས་ཀྱང་མི་སྐྱོའོ། ། ལུས་སྡུག་བསྔལ་ཉིད་དུ་ཡང་སོ་སོར་རྟོག་མོད་ཀྱི་ལུས་ཀྱི་སྡུག་བསྔལ་བས་ཀྱང་ཡོངས་སུ་མི་གདུང་ངོ་། ། ལུས་བདག་མེད་པ་ཉིད་དུ་ཡང་སོ་སོར་རྟོག་མོད། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ལ་ཡང་མི་སྐྱོའོ། ། ལུས་ཞི་བ་ཉིད་དུ་ཡང་སོ་སོར་རྟོག་མོད་ཀྱི། ལུས་ཞི་བས་བཏང་སྙོམས་སུ་ཡང་མི་ལྟུང་ངོ་། ། ལུས་སྟོང་པ་ཉིད་དང་། ལུས་དབེན་པ་ཉིད་དུ་ཡང་སོ་སོར་རྟོག་མོད་ཀྱི། དབེན་པའི་མུར་ཡང་མི་ལྟུང་ངོ་། ། དེ་ལུས་ལ་ལུས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་གནས་པ་ན་ལུས་ལ་རྫས་དང་སྙིང་པོར་རྗེས་སུ་མི་མཐོང་ངོ་། །
en: “Impelled by this thorough investigation, he maintains his body that is based on the principal elements, and being conscious of the benefits of doing so, he thinks, ‘I will let this body expire if that will be of any use to sentient beings. The four principle external elements—the earth element, the water element, the fire element, and the wind element—act as sustenance for sentient beings in various different ways, by means of various different kinds of objects, in many ways, using many kinds of tools. They can be used in various different ways. In just the same way, may this bundle of mine, which consists of the four principal elements, act as sustenance for sentient beings in various different ways, by means of various different kinds of objects, in many ways, using many kinds of tools. May it be used in various different ways.’ The impermanence of the body is evident to him, yet birth, death, and rebirth do not leave him feeling dejected. The suffering of the body is evident to him, yet he does not let the suffering of the body bring him down. It is evident to him that the body has no self, yet in order to bring sentient beings to maturity, he does not allow himself to become dejected. The peacefulness of the body is evident to him, yet the peacefulness of the body does not leave him apathetic. The emptiness of the body and the isolation of the body is evident to him, yet he does not fall into the views of an isolationist.

source: ནང་གི་ལུས་ལ་ཡང་ལུས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་གནས་པ་ན་ནང་གི་རྗེས་སུ་སོང་བའི་ཉོན་མོངས་པ་རྣམས་ཀྱི་གོ་སྐབས་མི་འབྱེད་དོ། ། དེ་ཕྱི་རོལ་གྱི་ལུས་ལ་ལུས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་གནས་པ་ན་ཕྱི་རོལ་གྱི་རྗེས་སུ་སོང་བའི་ཉོན་མོངས་པ་རྣམས་དང་ལྷན་ཅིག་མི་གནས་སོ། ། དེ་ལུས་ཉོན་མོངས་པ་མེད་པས་ལུས་ཀྱི་ལས་ཡོངས་སུ་དག་པ་དང་ལྡན་པ་ཡིན་ནོ། ། དེ་ལུས་ཡོངས་སུ་དག་ནས་ མཚན་གྱིས་ཡང་དག་པར་བརྒྱན་པའི་སྐུ་འཐོབ་བོ། །དེ་ལུས་མཚན་གྱིས་བརྒྱན་པར་གྱུར་ནས་ ལྷ་དང་མི་རྣམས་མངོན་དུ་འདུལ་བར་འགྱུར་ཏེ དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ལུས་ལ་ལུས་ཀྱི་རྗེས་སུ་ལྟ་བའི་དྲན་པ་ཉེ་བར་གཞག་པ་སྒོམ་པའོ། །
en: “He dwells on the body and observes the body, and he does not find any essence or substance to it. He dwells on the internal body and observes the body, and he does not allow room for the vices to remain inside him. He dwells on the external body and observes the body, and he does not remain connected to the external vices. Having freed his body from the corruptions, his bodily actions are purified. His purified body attains the physical ornaments of the characteristics, and his ornamented body attracts the recognition of gods and men. This is how the bodhisatva uses the body to cultivate mindfulness by observing the body.

source: ཡང་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའི་ཚོར་བ་ལ་ཚོར་བའི་རྗེས་སུ་ལྟ་བའི་དྲན་པ་ཉེ་བར་གཞག་པ་སྒོམ་པ་ཡིན་ཞེ་ན། འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་གང་ཅི་ཚོར་ཡང་རུང་དེ་ཐམས་ཅད་སྡུག་བསྔལ་ལོ། ། ཞེས་དེ་སྙམ་དུ་སེམས་ཏེ། དེ་ཡེ་ཤེས་ཀྱིས་རྟོགས་པ་དང་། ཤེས་རབ་ཀྱིས་རྟོགས་པ་དང་། ཐབས་ཀྱིས་རྟོགས་པའི་ཚོར་བ་ཤིན་ཏུ་རྟོགས་པས་བདེ་བར་ཚོར་བ་ཚོར་བར་བྱེད་མོད་ཀྱི། འདོད་ཆགས་ཀྱི་བག་ལ་ཉལ་ཡང་བག་ལ་ཉལ་བར་མི་བྱེད་དོ། ། སྡུག་བསྔལ་བའི་ཚོར་བས་རེག་ནས་ཀྱང་ངན་སོང་དུ་སྐྱེས་པ་ཐམས་ཅད་ལ་སྙིང་རྗེ་ཆེན་པོ་སྐྱེད་ཅིང་ཁོང་ཁྲོ་བའི་བག་ལ་ཉལ་བ་ཡང་བག་ལ་ཉལ་བར་མི་བྱེད་དོ། ། བདེ་བ་ཡང་མ་ཡིན་སྡུག་བསྔལ་བ་ཡང་མ་ཡིན་པའི་ཚོར་བས་རེག་ཀྱང་མ་རིག་པའི་བག་ལ་ཉལ་ཡང་བག་ལ་ཉལ་བར་མི་བྱེད་དོ། ། དེ་ཚོར་བའི་རྗེས་སུ་སོང་བའི་དྲན་པས་བདེ་བའམ། སྡུག་བསྔལ་བའམ། བདེ་བ་ཡང་མ་ཡིན་སྡུག་བསྔལ་བ་ཡང་མ་ཡིན་པའི་ཚོར་བ་གང་ཚོར་བ་ཡང་ཚོར་བ་དེ་དག་ལས་འབྱུང་བར་ལྟ་བ་ཡིན་ནོ། ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཚོར་བ་ཡོངས་སུ་ཤེས་ཤིང་ཞི་བའི་ཕྱིར་ཡང་འཇུག་སྟེ། སེམས་ཅན་འདི་དག་ནི་ཚོར་བ་ལས་འབྱུང་བར་མི་ཤེས་པས་དེ་དག་བདེ་བའི་ཚོར་བ་ལ་དགའ་བར་བྱེད། སྡུག་བསྔལ་བའི་ཚོར་བ་ལ་ཞེ་སྡང་བར་བྱེད། བདེ་བ་ཡང་མ་ཡིན་སྡུག་བསྔལ་བ་ཡང་མ་ཡིན་པའི་ཚོར་བ་ལ་རྨོངས་པར་བྱེད་ཀྱི། བདག་ནི་ཤེས་རབ་དང་། ཡེ་ཤེས་ཀྱིས་རྗེས་སུ་རྟོགས་པའི་ཚོར་བ་ཐམས་ཅད་སོ་སོར་སྦྱངས་པ་དང་། ཐབས་མཁས་པ་དང་། སྙིང་རྗེ་ཆེན་པོས་ཡོངས་སུ་བཟུང་བའི་རྩོམ་པས་སེམས་ཅན་དེ་དག་གི་ཚོར་བ་ཐམས་ཅད་རྒྱུན་གཅོད་པའི་ཕྱིར་ཆོས་བསྟན་པར་བྱའོ། །
en: “How does one use feelings to cultivate mindfulness by observing feelings? The bodhisatva will think, ‘Any feeling whatsoever one may have is suffering.’ With this insight into feelings he can experience pleasant feelings with an understanding of knowledge, an understanding of wisdom, and an understanding of means, and not pursue the tendency toward attachment. When he experiences painful feelings, he develops great compassion for all those born into lower states of existence, and he does not pursue the tendency toward anger. When he experiences feelings that are neither painful nor pleasant, he experiences feelings that are neither painful nor pleasant, but he nonetheless does not pursue the tendency toward ignorance. He pays attention to his feelings with mindfulness, and whether he experiences feelings that are pleasant, feelings that are painful, or feelings that are neither pleasant nor painful, his view is free from these feelings. He takes it upon himself to understand and alleviate the feelings of all sentient beings: ‘These sentient beings do not know how to be free from their feelings. They are overjoyed by pleasant feelings, distressed by painful feelings, and indifferent to feelings that are neither painful nor pleasant. How sad! As we have alleviated all feelings by applying wisdom and knowledge when we experience feelings and have combined this with the application of skillful means and great compassion, we will take it upon ourselves to instruct them in the Dharma so that all the feelings of these sentient beings may be alleviated.’

source: ཅིའི་ཕྱིར་ཚོར་བ་ཞེས་བྱ་ཞེ་ན། རྟོགས་པའི་ཚོར་བ་ནི་བདེ་བར་འགྱུར་རོ། ། མ་རྟོགས་པའི་ཚོར་བ་ནི་སྡུག་བསྔལ་བར་འགྱུར་རོ། ། དེ་ལ་རྟོགས་པའི་ཚོར་བ་གང་ཞེ་ན། འདི་ལ་བདག་གམ། སེམས་ཅན་ནམ། སྲོག་གམ། གང་ཟག་གང་ཡང་ཚོར་བར་བྱེད་པ་མེད་དེ། ཆགས་པ་ནི་ཚོར་བའོ། ། ཡོངས་སུ་འཛིན་པ་ནི་ཚོར་བའོ། ། ལེན་པ་ནི་ཚོར་བའོ། ། ཕྱིན་ཅི་ལོག་ནི་ཚོར་བའོ། ། རྣམ་པར་རྟོག་པ་ནི་ཚོར་བའོ། ། ལྟ་བའི་བག་ལ་ཉལ་ནི་ཚོར་བའོ། ། མིག་ཏུ་འདུ་ཤེས་པ་ཚོར་བ་ཡིན་པ་ནས་ཡིད་ཀྱི་བར་དུ་འདུ་ཤེས་པ་ནི་ཚོར་བའོ། ། གཟུགས་སུ་འདུ་ཤེས་པ་ཚོར་བ་ཡིན་པ་ནས་ཆོས་སུ་འདུ་ཤེས་པའི་བར་དུ་ནི་ཚོར་བའོ། ། གང་མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་ལས་བྱུང་བའི་ཚོར་བ་བདེ་བའམ་སྡུག་བསྔལ་བའམ། བདེ་བ་ཡང་མ་ཡིན། སྡུག་བསྔལ་བ་ཡང་མ་ཡིན་པའི་བར་དུ་དེ་ནི་ཚོར་བ་ཞེས་བྱའོ། ། གོང་མ་བཞིན་དུ་ནང་དང་ཕྱིའི་ཆོས་རྣམས་སྦྱར་ཏེ། ཡིད་ཀྱི་བར་དུ་འདུས་ཏེ་རེག་པའི་རྐྱེན་ལས་བྱུང་བའི་ཚོར་བ་བདེ་བའམ། སྡུག་བསྔལ་བའམ། བདེ་བ་ཡང་མ་ཡིན། སྡུག་བསྔལ་བ་ཡང་མ་ཡིན་པའི་བར་དུ་དེ་ནི་ཚོར་བ་ཞེས་བྱའོ། །
en: “Why is it that we call them feelings? A feeling that is combined with understanding leads to pleasure, while a feeling that is combined with a lack of understanding leads to pain. What does it mean to combine a feeling with understanding? It means that there is nothing there that feels—no self, no being, no life force, and no person. Feeling is attachment. Feeling is appropriation. Feeling is grasping. Feeling is misunderstanding. Feeling is conceptualization. Feeling is the tendency to see. Feeling is the perceptions of the eye, and so forth, up to and including the perceptions of the mind. Feeling is the perception of form, and so forth, up to and including the perception of mental objects. Feeling is what arises from contact with the eye, feelings that are referred to as either painful, pleasant, or neither painful nor pleasant. Internal and external phenomena can be added here as before. Feeling is what arises from contact with the mind, feelings that are referred to as either painful, pleasant, or neither painful nor pleasant.

source: གཞན་ཡང་རྣམ་གྲངས་ཀྱིས་ཚོར་བ་གཅིག་སྟེ། དེ་ནི་སེམས་གཅིག་པུས་རྣམ་པར་རིག་པའོ། ། ཚོར་བ་གཉིས་ཏེ། ཕྱི་དང་ནང་གིའོ། །ཚོར་བ་གསུམ་སྟེ། འདས་པ་རྣམ་པར་རིག་པ་དང་། མ་འོངས་པ་རྣམ་པར་རིག་པ་དང་། ད་ལྟར་བྱུང་བ་རྣམ་པར་རིག་པའོ། ། ཚོར་བ་བཞི་སྟེ། དེ་ནི་ཁམས་བཞི་རྣམ་པར་རིག་པའོ། ། ཚོར་བ་ལྔ་སྟེ། དེ་ནི་ཕུང་པོ་ལྔ་ཡིད་ལ་བྱེད་པའོ། ། ཚོར་བ་དྲུག་སྟེ། དེ་ནི་སྐྱེ་མཆེད་དྲུག་ཡོངས་སུ་རྟོག་པའོ། ། ཚོར་བ་བདུན་ཏེ། དེ་ནི་རྣམ་པར་ཤེས་པ་གནས་པ་བདུན་ནོ། ། ཚོར་བ་བརྒྱད་དེ། དེ་ནི་ལོག་པར་ངེས་པའི་སྦྱོར་བ་བརྒྱད་དོ། ། ཚོར་བ་དགུ་སྟེ། དེ་ནི་སེམས་ཅན་གྱི་གནས་དགུའོ། ། ཚོར་བ་བཅུ་སྟེ། དེ་ནི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་མོ། ། གོང་མ་བཞིན་དུ་སྦྱར་ཏེ།
en: “Moreover, feeling can be enumerated: Feeling is singular; it is the perception of a single mental event. Feeling is twofold; it is the internal and the external. Feeling is threefold; it is the perception of the past, the perception of the future, and the perception of the present. Feeling is fourfold; it is the perception of the four elements. Feeling is fivefold; it is to conceive of the five skandhas. Feeling is sixfold; it is the idea of the six sense fields. Feeling is sevenfold; it is the seven states of consciousness. Feeling is eightfold; it is the eight mistaken kinds of engagement. Feeling is ninefold; it is the nine abodes of sentient beings. Feeling is tenfold; it is the ten wholesome forms of conduct. This enumeration could be continued.

source: ཐམས་ཅད་ནི་ཚོར་བ་སྟེ། དམིགས་པ་ཇི་སྙེད་པ་དང་། ཡིད་ལ་བྱེད་པ་ཇི་སྙེད་པ་དེ་ཐམས་ཅད་ཚོར་བར་བྱ་བའོ། ། དེ་བས་ན་སེམས་ཅན་ཚད་མེད་པའི་ཚོར་བ་ཚད་མེད་པ་ཞེས་བྱའོ། ། དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཚོར་བ་ལ་ཚོར་བའི་རྗེས་སུ་ལྟ་ཞིང་གནས་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཚོར་བ་སྐྱེ་བ་དང་། འཇིག་པ་དང་། གནས་པ་ལ་ཡེ་ཤེས་བསྐྱེད་པར་བྱ་སྟེ། གང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དགེ་བ་དང་། མི་དགེ་བའི་ཚོར་བ་ལ་ཚོར་བར་ཤེས་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཚོར་བ་ལ་ཚོར་བའི་རྗེས་སུ་ལྟ་བའི་དྲན་པ་ཉེ་བར་གཞག་པའོ། །
en: “Everything is feeling. Any kind of object or mental process will be experienced as feeling. This is why it is said that there are immeasurably many sentient beings with immeasurably many kinds of feelings, and the bodhisatva who dwells with feelings and observes his feelings develops the knowledge of how the feelings of all sentient beings arise, remain, and cease. This is the knowledge of the feelings of all sentient beings, of wholesome and unwholesome feelings. This is what is known as the bodhisatva’s foundation of mindfulness that involves observing feelings.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་སེམས་ལ་སེམས་ཀྱི་རྗེས་སུ་ལྟ་བའི་དྲན་པ་ཉེ་བར་གཞག་པ་གང་ཞེ་ན། གང་བྱང་ཆུབ་སེམས་དཔའ་དེའི་མི་བརྗེད་པ་དང་། སྦ་བ་དང་། ཀུན་སྲུང་བ་དང་། མི་གཡེང་བའོ། ། དེ་འདི་ལྟར་སོ་སོར་རྟོག་སྟེ། སེམས་ནི་སྐྱེས་ནས་འཇིག་ཅིང་ཞུ་སྟེ་མི་གནས་པས་ནང་ན་ཡང་མི་གནས། ཕྱི་རོལ་དུ་ཡང་མི་འཕོ་སྟེ། གང་བདག་གིས་ཐོག་མར་སེམས་བསྐྱེད་པ་དེ་ཡང་ཟད་མེད། རྣམ་པར་གྱུར་ཏེ། ཡུལ་ན་མི་གནས། ཕྱོགས་ན་མི་གནས་པས་དེ་རྙེད་པར་མི་ནུས་ཏེ། སེམས་གང་གིས་དགེ་བའི་རྩ་བ་བསྒྲུབས་པ་དེ་དག་ཀྱང་ཟད་མེད། རྣམ་པར་གྱུར། ཡུལ་ན་མི་གནས། ཕྱོགས་ན་མི་གནས་སོ། ། གང་ཡང་བྱང་ཆུབ་ཏུ་བསྔོས་པའི་སེམས་དེ་ཡང་ངོ་བོ་ཉིད་ཀྱིས་མཚན་ཉིད་མེད་པ་སྟེ། སེམས་ཀྱིས་སེམས་རབ་ཏུ་མི་ཤེས། སེམས་ཀྱིས་སེམས་མི་མཐོང་། སེམས་ཀྱིས་སེམས་མི་ཚོར་ན་གང་གིས་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའི་སེམས་དེ་གང་ཡིན། གང་བྱང་ཆུབ་ཀྱི་སེམས་དེ་ནི་དགེ་བའི་རྩ་བའི་སེམས་དང་མི་འགྲོགས། གང་དགེ་བའི་རྩ་བའི་སེམས་དེ་ཡང་བསྔོ་བའི་སེམས་དང་མི་འགྲོགས། གང་བསྔོ་བའི་སེམས་དེ་ཡང་བྱང་ཆུབ་ཀྱི་སེམས་དང་། དགེ་བའི་རྩ་བའི་སེམས་དང་མི་འགྲོགས་སོ། ། ཞེས་དེ་དེ་ལྟར་སོ་སོར་རྟོག་པ་ན་མི་སྐྲག ། མི་དངང་། དངང་བར་མི་འགྱུར་གྱི།
en: “Now, how does the bodhisatva practice the foundation of mindfulness of the mind by observing the mind? The bodhisatva is not absent-minded but is careful, conscientious, and undistracted, and he reflects carefully: ‘The mind appears and then disperses and dissolves. It does not remain. It does not dwell inside, nor does it proceed to anywhere outside. The initial thought that I gave rise to has vanished. It has disappeared. It has changed. It is not situated in any particular place. It is not facing in any particular direction. It cannot be ascertained. The thought that led to a root of virtue being established has vanished. It has disappeared. It has changed. It is not situated in any particular place. It is not facing in any particular direction. The mind that is dedicated to awakening essentially has no characteristics. The mind cannot know the mind. The mind cannot see the mind. The mind cannot experience the mind. What, then, is this mind? Is it that through which I will realize unsurpassed perfect awakening? There is no relationship between the mind of awakening and the mind of the roots of virtue. There is no relationship between the mind of the roots of virtue and the mind that is dedicated to awakening. There is no relationship between the mind that is dedicated to awakening and the mind of awakening or the mind of the roots of virtue.’ In this way he reflects with no discomfort, with no fear, without becoming afraid.

source: དེ་ཡང་འདི་སྙམ་དུ་སེམས་ཏེ། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ཟབ་མོ་རྒྱུ་དང་འབྲས་བུ་ཆུད་མི་ཟ་བའོ། ། གལ་ཏེ་སེམས་ཀྱི་ཆོས་ཉིད་དེ་ལྟ་བུ་སེམས་ཀྱི་རང་བཞིན་ཉིད་ཡིན་ཡང་ཆོས་ཐམས་ཅད་རྒྱུ་དང་རྐྱེན་ལ་རག་ལས་པ། གཡོ་བ་མེད་པ། བྱེད་པ་མེད་པ། བདག་པོ་མེད་པ། ཇི་ལྟར་འདོད་པ་དེ་བཞིན་དུ་འགྲུབ་ཀྱིས་བདག་གིས་བསྒྲུབ་པ་ལ་བརྩོན་པར་བྱའོ། ། སེམས་ཀྱི་ཆོས་ཉིད་དེ་མི་འབྲི་བར་བྱའོ། ། དེ་ལ་སེམས་ཀྱི་ཆོས་ཉིད་གང་། སྒྲུབ་པ་གང་ཞེ་ན། སེམས་ནི་སྒྱུ་མ་དང་འདྲ་བ་སྟེ། དེ་ལ་སྒྲིབ་པར་བྱེད་པ་ཡང་སུ་ཡང་མེད་དེ། དེ་ནི་སེམས་ཀྱི་ཆོས་ཉིད་དོ། ། གང་ཡང་བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་བཏང་ནས་སངས་རྒྱས་ཀྱི་ཞིང་རྣམ་པར་བསྒྲུབ་པའི་རྒྱན་དུ་སྔོ་བར་བྱེད་པ་དེ་ནི་སྒྲུབ་པར་བྱེད་པའོ། །
en: “He also thinks, ‘Dependent origination is a profound topic. Causes and their effects do not fail to take place. If the actual state of mind represented an inherent nature of the mind, then the dependence of all phenomena on causes and conditions would be useless, dysfunctional, and powerless. What one wishes for is what one accomplishes, so I will apply myself to what should be accomplished. I will not let this actual state of the mind wither. What is the actual state of the mind, and what is it that is accomplished? The mind is like an illusion; there is no one here who gives. This is the actual state of the mind. Still, when all notions of ownership have been done away with and been transformed into the ornament that is the accomplishment of a buddha field, something has been accomplished.
